"use client"

import { Table, Divider, Col } from "antd";

const { Column, ColumnGroup } = Table;
export default function General() {
    return (
        <main className="flex flex-col items-center justify-between top-0 pt-10 xxs:pt-0">
            <div className="container max-w-screen-sm md:max-w-screen-md lg:max-w-screen-lg flex flex-col items-center justify-center py-10 px-10 gap-2" id="content">
                <h1 className="text-xl font-black">วิชาการสวนกุหลาบฯ</h1>
                <h1 className="text-3xl font-bold text-center">โครงการจัดการเรียนการสอนตามหลักสูตรกระทรวงศึกษาธิการเป็นภาษาอังกฤษ</h1>
                <h2 className="text-xl font-bold">English Program : EPLUS+</h2>
                <p className="text-center">EPLUS+ ประกอบด้วยความพิเศษทั้งหมด 8+ ที่จะส่งเสริมให้นักเรียนก้าวข้ามขีดจำกัด สู่อีกขั้นของการเรียนรู้</p>
                <h2 className="text-xl font-bold">PLUS ONE ที่สุดของความเป็นเลิศทางภาษา</h2>
                <p className="text-center">นักเรียน EPLUS+ จะได้พบกับการเรียนการสอนเป็นภาษาอังกฤษในสาระวิชาต่างๆเช่น วิทยาศาสตร์ คณิตศาสตร์สังคมศึกษาฯ พลศึกษา เทคโนโลยี รวมถึงภาษาอังกฤษเอง โดยเจ้าของภาษา รวม 21 คาบเรียนต่อสัปดาห์นอกจากนี้ยังได้รับการเสริมทักษะภาษาต่างประเทศที่ 2 ได้แก่ ภาษาจีน ภาษาญี่ปุ่น และภาษาฝรั่งเศส ซึ่งให้นักเรียนเลือกเรียนตามความสนใจได้คนละ 1 ภาษา อีกทั้งยังมีการจัดการแข่งขันทักษะภาษาประเภทต่างๆ ให้นักเรียน EPLUS+ ทุกคนได้เข้าร่วม เพื่อแสดงศักยภาพสูงสุด และพัฒนาตนเองไปสู่ความเป็นเลิศด้านการสื่อสาร</p>
                <Divider />
                <h2 className="text-xl font-bold">PLUS TWO ที่สุดของบุคลากรที่มากประสบการณ์และรับรองมาตรฐาน</h2>
                <p className="text-center">ครูชาวต่างประเทศในโปรแกรม EPLUS+ ทุกท่าน จบการศึกษาในสาขาวิชาเอกภาษาอังกฤษ วิทยาศาสตร์ และคณิตศาสตร์จากมหาวิทยาลัยชั้นนำ และได้ผ่านการฝึกอบรมในคอร์ส CELTA (ประกาศนียบัตรรับรองการสอนภาษาอังกฤษในฐานะภาษาต่างประเทศ) จากสถาบันที่รับรองจาก Cambridge English Language Assessment นอกจากนี้ยังมีประวัติการศึกษาและประวัติการทำงานที่แตกต่างหลากหลาย ซึ่งจะเป็นแรงผลักดันให้นักเรียน EPLUS+ ก้าวไกลเกินขีดจำกัดของตนเองได้อย่างแน่นอน</p>
                <Divider />
                <h2 className="text-xl font-bold">PLUS THREE ที่สุดของระบบ Co-Teaching และ Tutoring</h2>
                <p className="text-center">ก่อนเปิดภาคเรียน นักเรียน EPLUS+ ระดับชั้น ม.1 จะได้รับการปรับพื้นฐานความรู้ด้านภาษาอังกฤษผ่านรายวิชาวิทย์-คณิต-อังกฤษ เป็นเวลา 5 วัน ในช่วงปลายเดือนเมษายนและในระหว่างภาคการศึกษา โดยมีครูชาวไทยเป็นที่ปรึกษาด้านหลักสูตร เนื้อหา การจัดกิจกรรมการเรียนการสอน ประสานงานรายวิชาที่จัดการเรียนการสอนเป็นภาษาอังกฤษ และให้คำแนะนำด้านวัฒนธรรมไทย เพื่อตอบโจทย์ความต้องการของนักเรียน EPLUS+ ให้มากที่สุดและที่พิเศษไปกว่านั้น เรามีวิทยากรผู้เชี่ยวชาญเฉพาะทางในด้านต่างๆที่หลากหลายมาสอนเสริมเนื้อหาอย่างเข้มข้นหลังเลิกเรียนอีก 1 ชั่วโมง เพื่อเป็นการทบทวน ฝึกทำโจทย์ที่ซับซ้อนขึ้น และเทียบเคียงกับเนื้อหาภาษาไทยเพื่อมุ่งสู่ความเป็นเลิศในการวัดผลระดับประเทศ</p>
                <Divider />
                <h2 className="text-xl font-bold">PLUS FOUR ที่สุดของแหล่งเรียนรู้</h2>
                <p className="text-center">EPLUS+ เราได้สร้างห้องสมุด EPLUS+ ที่ทันสมัย เพื่อเป็นแหล่งสืบค้นข้อมูลโดยเฉพาะประกอบไปด้วยหนังสืออ้างอิง ตำราภาษาไทย และภาษาต่างประเทศ ที่เกี่ยวข้องกับสาระวิชาเรียน และตอบสนองความต้องการของหลักสูตร EPLUS+ นอกจากนี้ นักเรียน EPLUS+ ยังสามารถใช้ห้องกุหลาบฟ้า ซึ่งเป็นแหล่งเรียนรู้ด้วยตนเองที่ทันสมัยโดยได้รับการสนับสนุนและพัฒนาระบบโดยสถาบัน On Demand อีกทั้งยังมีห้องกุหลาบเพชร ซึ่งใช้ระบบเพื่อนช่วยเพื่อนพี่ติวน้อง สร้างบรรยากาศการเรียนรู้ที่อบอุ่น เพื่อมุ่งสู่ความเป็นเลิศในด้านวิชาการและการศึกษาที่ยั่งยืน</p>
                <Divider />
                <h2 className="text-xl font-bold">PLUS FIVE ที่สุดของการศึกษาในโลก Digital</h2>
                <p className="text-center">เพื่อให้สอดรับและตอบสนองการเปลี่ยนแปลงอย่างรวดเร็วในปัจจุบัน เราได้มีการจัดการเรียนการสอนด้วยการใช้เทคโนโลยีในการเรียนการสอนเชิงสร้างสรรค์ เช่น การโต้ตอบในห้องเรียนออนไลน์ผ่านเครือข่ายGoogle Classroom, การปฏิบัติการผ่านประสบการณ์จริงด้วย Social Network, การสร้างสรรค์ Graphic Designและการตัดต่อ ผ่านโปรแกรมที่หลากหลาย รวมถึงการทำวิจัยเบื้องต้นตลอดจนขั้นสูง ผ่านฐานข้อมูลออนไลน์และโปรแกรมสำเร็จรูปทางสถิติ เพื่อเป็นการสร้างรากฐานในการเป็นนักแสวงหาความรู้ นักคิดวิเคราะห์ นักเขียน สู่การเป็นนักวิจัยรุ่นเยาว์ที่มีทักษะเชิงบูรณาการ</p>
                <Divider />
                <h2 className="text-xl font-bold">PLUS SIX ที่สุดของค่ายยกระดับทักษะชีวิตและวิชาการ</h2>
                <p className="text-center">ทักษะชีวิตมีความสำคัญยิ่งต่อเด็กสวนฯ ทุกคน การเรียนรู้ที่จะอยู่ร่วมกันอย่างมีความสุขการทำกิจกรรมเพื่อเสริมสร้างความเชื่อมั่นและภาวะผู้นำ ความรักและภาคภูมิใจในสถาบันอันมีเกียรติประวัติดีงามและยาวนานความเคารพต่อครูและกตัญญูต่อพ่อแม่ รวมถึงความนับถือต่อพี่ จึงเป็นคุณสมบัติที่สำคัญที่นักเรียน EPLUS+ จะได้รับการฝึกฝนเราจึงได้จัดกิจกรรมค่าย EQ, ค่ายส่งเสริมภาวะผู้นำ, และค่ายจิตอาสา ไม่ซ้ำกันในแต่ละปี เพื่อให้นักเรียน EPLUS+ได้พบกับประสบการณ์เสมือนจริงที่แตกต่างหลากหลาย สำหรับทักษะทางวิชาการ เราได้จัดค่ายบูรณาการScience-Maths-English ขึ้นเป็นประจำทุกปี จากความร่วมมือทางวิชาการของโรงเรียนสวนกุหลาบวิทยาลัยและสถาบันพัฒนาวิทยาศาสตร์และเทคโนโลีแห่งชาติ (สวทช.) และสถาบันที่มีความเชี่ยวชาญทางด้านภาษา เพื่อสร้างเสริมประสบการณ์รอบด้านสู่การเป็นบุคลากรคุณภาพระดับมาตรฐานสากล</p>
                <Divider />
                <h2 className="text-xl font-bold">PLUS SEVEN ที่สุดของการวัดระดับทางภาษา</h2>
                <p className="text-center">นักเรียน EPLUS+ ทุกคนต้องผ่านการวัดระดับความสามารถทางภาษาทั้งก่อนและหลังเรียนเพื่อให้ทราบความก้าวหน้าของตนเองในแต่ละปี โดยแบบทดสอบที่มีมาตรฐานที่ผ่านการรับรองจาก Cambridge Universityซึ่งได้รับการสนับสนุนจากโครงการวิจัยที่ใหญ่ที่สุดในประเภทของข้อสอบ ดังนั้น Cambridge English Test ได้แก่ Key English Test (KET) และ Preliminary English Test (PET) จะทำให้ทักษะด้านภาษาของนักเรียน EPLUS+เป็นที่ยอมรับและน่าเชื่อถือ โดยในแต่ละระดับชั้นจะต้องผ่านมาตรฐานตามระดับในตารางมาตรฐานภาษาอังกฤษของสหภาพยุโรป Common European Framework of Reference (CEFR) เพื่อเป็นการเตรียมความพร้อมนักเรียน EPLUS+ ได้ชื่อว่ามีมาตรฐานระดับนานาชาติ</p>
                <Divider />
                <h2 className="text-xl font-bold">PLUS EIGHT ที่สุดของการเปิดโลกทัศน์สู่สากล</h2>
                <p className="text-center">เพื่อผลักดันนักเรียนสู่ศักยภาพระดับสากล การเรียนรู้ผ่านประสบการณ์จริงในประเทศเจ้าของภาษาเป็นกิจกรรมที่ขาดไม่ได้สำหรับนักเรียน EPLUS+ เราจึงจัดให้มีโครงการทัศนศึกษาภายในประเทศ รวมถึงโครงการแลกเปลี่ยนภาษาและวัฒนธรรมในต่างประเทศ เช่น สิงคโปร์ ออสเตรเลีย นิวซีแลนด์ แคนาดา อเมริกา และอังกฤษ กับPartner Schools ซึ่งเป็นการสร้างโอกาสให้นักเรียนได้ใช้ภาษาและทักษะชีวิตในบริบทจริง โดยเราจะสนับสนุนเงินในการเข้าร่วมโครงการกับทาง EPLUS+ คนละ 20,000 บาททุกปีการศึกษา เพื่อให้นักเรียน EPLUS+ เกิดแรงบันดาลใจ ความมั่นใจ และสร้างภาวะผู้นำ ได้รับการยอมรับจากสังคม สู่การเป็นพลเมืองโลกที่มีศักยภาพ</p>
            </div>
        </main>
    )
}