'use client'

import Image from 'next/image'
import { createContext } from "react";
import { Container } from 'react-bootstrap'

const Context = createContext();

export default function Math() {
    return (
        <><div className='d-flex res-bg align-items-center page-cov' id='cover'>
            <Container className="justify-content-end align-items-center text-center">
                <a className="cover-title font-black">อาคารสถานที่</a><br />
            </Container>
        </div>
        <div className="anc">
            <Container className="d-table justify-content-center align-items-center align-middle text-center m-auto" id="main">
                <a>
                    <div className="d-block justify-content-start align-items-start text-start grid grid-big" id="grid">
                        <div className="d-flex justify-content-center align-items-center align-middle grid-img-con grid-img-con-big float-left mr-5">
                            <img src="http://96.30.126.41/sk/userfiles/images/building1_1.jpg"></img>
                        </div>
                        <p className="font-bold text-start anc-title">อาคารสวนกุหลาบ</p>
                        <p className="font-bold text-start anc-text">อาคารสวนกุหลาบ (ตึกยาว) เป็นอาคารเรียนหลังแรกของโรงเรียนสวนกุหลาบวิทยาลัยที่สร้างขึ้นใหม่ มีลักษณะเป็นสถาปัตกรรมที่มีความโดดเด่นและสง่างาม มีประวัติความเป็นมาที่มีคุณค่ายิ่งต่อสังคมไทย ชาวสวนกุหลาบทุกคนจึงมีความภาคภูมิใจ และถือว่าเป็นเอกลักษณ์ที่สำคัญอย่างหนึ่งของโรงเรียน</p>
                        <p className="font-bold text-start anc-text">อาคารสวนกุหลาบ เริ่มสร้าง 8 ตุลาคม พ.ศ. 2453 เปิดใช้ 25 มิถุนายน พ.ศ. 2454 มีเพียงชั้นบนและล่าง ตึกยาวมีความยาว 198.35 เมตร กว้าง 11.35 เมตร เนื้อที่ตึกยาวทั้งหมด 1ไร่ 1 งาน 60 ตารางวา เป็นอาคารทรงยุโรป 2 ชั้น ขนานไปกับถนนตรีเพชร หลังคามุงด้วยกระเบื้องลอนสีอิฐ ภายในกั้นเป็นห้อง ๆ เป็นห้องขนาด 15 เมตร คูณ 9 เมตร 1 ห้อง สลับกับห้องเล็ก 9 เมตร คูณ 7 เมตร 2 ห้อง ตลอดความยาวของตึก</p>
                        <p className="font-bold text-start anc-text">อาคารหลังนี้ พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว โปรดให้เจ้าหน้าที่เขียนแบบ ซึ่งจะมีลวดลายมากกว่าในปัจจุบัน ซึ่งสร้างขึ้นในปี พ.ศ.2452 แล้วเสร็จในปี พ.ศ. 2453 พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวได้เสร็จทอดพระเนตรทั้งๆ ที่ยังทรงพระประชวรอยู่ เมื่อการก่อสร้างแล้วเสร็จ เจ้าพระยาพระเสด็จสุเรนทราธิบดี เสนาบดีกระทรวงธรรมการ ได้เป็นผู้ทำพิธีเปิดตึกนี้ โรงเรียนสวนกุลาบได้ใช้ตึกนี้เป็นที่เล่าเรียนตลอดมา</p>
                        <p className="font-bold text-start anc-text">ประวัติเดิมมีว่าวัดราชบูรณะจะสร้างตึกแถวเพื่อเก็บค่าเช่า ทางกระทรวงธรรมการจึงได้มีหนังสือกราบทูลพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู ่หัว โดยทูลขอพระราชทานที่ตรงท้ายวัดราชบูรณะและขอเช่าตึกแถวทั้งหมดแทนประชาชน โดยเก็บจากนักเรียนคนละบาท และตึกนั้นจะต้องยาวไปตามถนนและข้างหน้าทำเป็นหน้าต่าง ข้างหลังจะให้ทำเป็นเฉลียงทางเดิน ค่าเช่าให้วัดโดยกระทรวงธรรมการให้ค่าเช่าวัดเป็นเงินร้อยละ 7.5</p>
                    </div>
                </a>
            </Container>
            <Container className="d-table justify-content-center align-items-center align-middle text-center m-auto" id="main">
                <a>
                    <div className="d-block justify-content-start align-items-start text-start grid grid-big" id="grid">
                        <div className="d-flex justify-content-center align-items-center align-middle grid-img-con grid-img-con-big float-left mr-5">
                            <img src="http://96.30.126.41/sk/userfiles/images/building1_1.jpg"></img>
                        </div>
                        <p className="font-bold text-start anc-title">อาคารสวนกุหลาบ</p>
                        <p className="font-bold text-start anc-text">อาคารสวนกุหลาบ (ตึกยาว) เป็นอาคารเรียนหลังแรกของโรงเรียนสวนกุหลาบวิทยาลัยที่สร้างขึ้นใหม่ มีลักษณะเป็นสถาปัตกรรมที่มีความโดดเด่นและสง่างาม มีประวัติความเป็นมาที่มีคุณค่ายิ่งต่อสังคมไทย ชาวสวนกุหลาบทุกคนจึงมีความภาคภูมิใจ และถือว่าเป็นเอกลักษณ์ที่สำคัญอย่างหนึ่งของโรงเรียน</p>
                        <p className="font-bold text-start anc-text">อาคารสวนกุหลาบ เริ่มสร้าง 8 ตุลาคม พ.ศ. 2453 เปิดใช้ 25 มิถุนายน พ.ศ. 2454 มีเพียงชั้นบนและล่าง ตึกยาวมีความยาว 198.35 เมตร กว้าง 11.35 เมตร เนื้อที่ตึกยาวทั้งหมด 1ไร่ 1 งาน 60 ตารางวา เป็นอาคารทรงยุโรป 2 ชั้น ขนานไปกับถนนตรีเพชร หลังคามุงด้วยกระเบื้องลอนสีอิฐ ภายในกั้นเป็นห้อง ๆ เป็นห้องขนาด 15 เมตร คูณ 9 เมตร 1 ห้อง สลับกับห้องเล็ก 9 เมตร คูณ 7 เมตร 2 ห้อง ตลอดความยาวของตึก</p>
                        <p className="font-bold text-start anc-text">อาคารหลังนี้ พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว โปรดให้เจ้าหน้าที่เขียนแบบ ซึ่งจะมีลวดลายมากกว่าในปัจจุบัน ซึ่งสร้างขึ้นในปี พ.ศ.2452 แล้วเสร็จในปี พ.ศ. 2453 พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวได้เสร็จทอดพระเนตรทั้งๆ ที่ยังทรงพระประชวรอยู่ เมื่อการก่อสร้างแล้วเสร็จ เจ้าพระยาพระเสด็จสุเรนทราธิบดี เสนาบดีกระทรวงธรรมการ ได้เป็นผู้ทำพิธีเปิดตึกนี้ โรงเรียนสวนกุลาบได้ใช้ตึกนี้เป็นที่เล่าเรียนตลอดมา</p>
                        <p className="font-bold text-start anc-text">ประวัติเดิมมีว่าวัดราชบูรณะจะสร้างตึกแถวเพื่อเก็บค่าเช่า ทางกระทรวงธรรมการจึงได้มีหนังสือกราบทูลพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู ่หัว โดยทูลขอพระราชทานที่ตรงท้ายวัดราชบูรณะและขอเช่าตึกแถวทั้งหมดแทนประชาชน โดยเก็บจากนักเรียนคนละบาท และตึกนั้นจะต้องยาวไปตามถนนและข้างหน้าทำเป็นหน้าต่าง ข้างหลังจะให้ทำเป็นเฉลียงทางเดิน ค่าเช่าให้วัดโดยกระทรวงธรรมการให้ค่าเช่าวัดเป็นเงินร้อยละ 7.5</p>
                    </div>
                </a>
            </Container>
        </div>
        </>
    )
}