"use client";

import Image from "next/image";
import Link from "next/link";
import { Table, Divider, Col, List, Menu } from "antd";


export default function Structure() {
    return (
        <main className="flex flex-col items-center justify-between top-0 pt-10 xxs:pt-0">
            <div className="container max-w-screen-sm md:max-w-screen-md lg:max-w-screen-lg flex flex-col items-center justify-center py-10 px-10 gap-2" id="content">
                <h1 className="text-lg lg:text-2xl font-bold">วิสัยทัศน์ พันธกิจ เป้าประสงค์ เอกลักษณ์ และอัตลักษณ์</h1>
                <Divider />
                <h2 className="text-xl font-bold">วิสัยทัศน์ของโรงเรียนสวนกุหลาบวิทยาลัย</h2>
                <p className="text-center">โรงเรียนสวนกุหลาบวิทยาลัยเป็นสถาบันการศึกษาชั้นนำในเวทีโลก สร้างสุภาพบุรุษสวนกุหลาบที่มีความสุข บนพื้นฐานคุณธรรม และวิถีความเป็นไทย</p>
                <Divider />
                <h2 className="text-xl font-bold">พันธกิจของโรงเรียน</h2>
                <List bordered>
                    <List.Item>พัฒนาหลักสูตรและกระบวนการจัดการเรียนรู้ตามเกณฑ์มาตรฐานสากลมุ่งสู่สถาบันการศึกษาชั้นนำในเวทีโลก</List.Item>
                    <List.Item>พัฒนาบริหารจัดการศึกษาอย่างเป็นระบบตามเกณฑ์คุณภาพมาตรฐานสากล</List.Item>
                    <List.Item>สร้างและพัฒนาผู้เรียนให้มีคุณลักษณะอันพึงประสงค์ สมรรถนะ และอัตลักษณ์ &quot;สุภาพบุรุษสวนกุหลาบ&quot; ตามที่โรงเรียนกำหนด</List.Item>
                    <List.Item>พัฒนาการบริการของโรงเรียน ตลอดจนสิ่งอำยวบความสะดวกที่เอื้อต่อการเรียนรู้ของผู้เรียน โดยมุ่งเน้นให้ผู้เรียนมีความสุขในการเรียน</List.Item>
                    <List.Item>ทำนุบำรุงสืบทอดศิลปวัฒนธรรมอันดีงามของชาติตามวิถีความเป็นไทย</List.Item>
                </List>
                <Divider />
                <h2 className="text-xl font-bold">เป้าประสงค์</h2>
                <List bordered>
                    <List.Item>โรงเรียนสวนกุหลาบวิทยาลัยเป็นสถาบันการศึกษาชั้นนำในเวทีโลก</List.Item>
                    <List.Item>การบริหารจัดการศึกษาของโรงเรียนสวนกุหลาบวิทยาลัยเป็นระบบตามเกณฑ์คุณภาพมาตรฐานสากล</List.Item>
                    <List.Item>ผู้เรียนมีคุณลักษณะอันพึงประสงค์ สมรรถนะ และอัตลักษณ์ &quot;สุภาพบุรุษสวนกุหลาบ&quot; ตามที่โรงเรียนกำหนด</List.Item>
                    <List.Item>การบริหารของโรงเรียนสวนกุหลาบวิทยาลัย ตลอดจนสิ่งอำนวยความสะดวกเอื้อต่อการเรียนรู้ของผู้เรียน ผู้เรียนมีความสุขในการเรียน</List.Item>
                    <List.Item>โรงเรียนสวนกุหลาบวิทยาลัย ทำนุบำรุงสืบสานศิลปวัฒนธรรมอันดีงามของชาติ ตามวีถีความเป็นไทย</List.Item>
                </List>
                <Divider />
                <h2 className="text-xl font-bold">เอกลักษณ์ : เป็นเลิศทางวิชาการและความเป็นผู้นำ</h2>
                <List bordered>
                    <List.Item>ผลสัมฤทธิ์ทางการเรียน (High Academic Achievement)</List.Item>
                    <List.Item>มีความสามารถในการแข่งขั้นทั้งในประเทศและต่างประเทศ (Achievement in International Competition)</List.Item>
                    <List.Item>ผู้กิจกรรมเด่น (Outstanding Student Activities)</List.Item>
                </List>
                <Divider />
                <h2 className="text-xl font-bold">อัตลักษณ์ : สุภาพบุรุษสวนกุหลาบฯ</h2>
                <p className="text-center"> สุภาพบุรุษสวนกุหลาบฯ หมายถึง นักเรียนสวนกุหลาบวิทยาลัยที่ได้รับการปลูกฝังให้มีคุณลักษณะในด้านการเป็นผู้นำ ดูแลเอาใจใส่บุคคลรอบข้างตามบทบาทหน้าที่ อันควรมีตัวชี้วัดแห่งความสำเร็จ ดังต่อไปนี้</p>
                <List bordered>
                    <List.Item>เป็นผู้นำ หมายถึง ลักษณะที่แสดงถึงการเป็นผู้กล้าแสดงออกในการพูด การกระทำที่ถูกต้องจนเป็นแบบอย่างให้ผู้อื่น</List.Item>
                    <List.Item>รักเพื่อน หมายถึง ลักษณะที่แสดงถึงความมีน้ำใจต่อเพื่อน มีความสามัคคีในหมู่คณะ ไม่ทอดทิ้งกันในยามยาก รู้จักทะนุถนอมน้ำใจ ให้อภัยซึ่งกันและกัน</List.Item>
                    <List.Item>นับถือพี่ หมายถึง ลักษณะที่แสดงออกถึงการมีสัมมาคารวะรุ่นพี่ผู้อาวุโสกว่า รับฟังคำแนะนำอย่างมีเหตุผล ยึดคุณลักษณะที่ถูกต้องของรุ่นพี่เป็นแบบอย่าง</List.Item>
                    <List.Item>เคารพครู หมายถึง ลักษณะที่แสดงออกถึงการตระหนัก ในคุณค่าของการประสิทธิ์ประสาทวิชาความรู้กตัญญูรู้คุณ อ่อนน้อมถ่อมตนต่อครูบาอาจารย์ เชื่อฟังคำสั่งสอนอย่างนอบน้อม</List.Item>
                    <List.Item>กตัญญูพ่อแม่ หมายถึง ลักษณะที่แสดงออกถึง ความสำนึกในพระคุณบุพการี และตอบแทนด้วยความซาบซึ้งใจ ปฏิบัติตนเป็นลูกที่ดีสม่ำเสมอ</List.Item>
                    <List.Item>ดูแลน้อง หมายถึง ลักษณะที่แสดงออกถึงความโอบอ้อมอารีต่อรุ่นน้อง ให้คำแนะนำในยามที่น้องเกิดปัญหา ดูแลด้วยความเต็มใจ โดยไม่หวังผลตอบแทน</List.Item>
                    <List.Item>สนองคุณแผ่นดิน หมายถึง การปฏิบัติตน เพื่อเป็นประโยชน์ของส่วนรวม อันได้แก่ ทำงานเพื่อชุมชน เพื่อแผ่นดิน และเพื่อประเทศชาติ</List.Item>
                </List>
            </div>
        </main>
    )
}
